## Terraform Plan 📋

| Step | Result |
|------|--------|
| 🖌 Format | `failure` |
| ⚙️ Init   | `success` |
| ✅ Validate | `success` |
| 📖 Plan  | `success` |

<details><summary>Show Plan Output</summary>

```hcl
module.space_bloom_hit_processer.data.archive_file.lambda_zip: Reading...
module.space_bloom_hit_processer.data.archive_file.lambda_zip: Read complete after 0s [id=d4fd073a793a78c667ee3d64f3e986f7faf3abe6]
module.hits_bucket_post.aws_s3_bucket.this: Refreshing state... [id=hits-file-post-prod]
module.hits_bucket_agg.aws_s3_bucket.this: Refreshing state... [id=hits-file-agg-prod]
module.hits_bucket_post.aws_s3_bucket_public_access_block.this: Refreshing state... [id=hits-file-post-prod]
module.hits_bucket_post.aws_s3_bucket_versioning.this: Refreshing state... [id=hits-file-post-prod]
module.hits_bucket_post.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=hits-file-post-prod]
module.hits_bucket_agg.aws_s3_bucket_versioning.this: Refreshing state... [id=hits-file-agg-prod]
module.hits_bucket_agg.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=hits-file-agg-prod]
module.hits_bucket_agg.aws_s3_bucket_public_access_block.this: Refreshing state... [id=hits-file-agg-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "space_bloom_hit_processer-prod"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::hits-file-post-prod"
      + statement_id        = "AllowS3Invoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_notification.raw_trigger will be created
  + resource "aws_s3_bucket_notification" "raw_trigger" {
      + bucket      = "hits-file-post-prod"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "raw/"
          + filter_suffix       = ".tsv"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.space_bloom_hit_processer.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "space_bloom_hit_processer-prod-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.space_bloom_hit_processer.aws_iam_role_policy.s3_read will be created
  + resource "aws_iam_role_policy" "s3_read" {
      + id          = (known after apply)
      + name        = "space_bloom_hit_processer-prod-s3-read"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:HeadObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::hits-file-post-prod/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.space_bloom_hit_processer.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/builds/function.zip"
      + function_name                  = "space_bloom_hit_processer-prod"
      + handler                        = "processor.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "x8gBmgOQcFKpO0KBclKhgk9Xnhc1DaCF5w88ExGO98k="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "prod"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

> 🔀 Merge this PR to trigger **Terraform Apply**
> *Actor: @gooseLoose | Commit: `7f0d797fb792987cb3b9902a17ecaeb0e2874ef2`*